{
    "welcomeScreen": {
        "descriptiveText": "You awaken in a shadowy tower, dimly lit by the flickering light of a few torches. A message floats before your eyes:\nYour arrival is honored\nYour gaze sweeps across the room: a modest Hall, with worn wooden furniture. At the far end, a stone staircase leads to the upper floor, where you imagine a Study full of secrets awaits.\nWhat do you explore first?",
        "option1": "The Hall (Information about Lena Cortés)",
        "option2": "The Study (coding experience)"
    },
    "hall": {
        "descriptiveText": "As you examine the Hall, you notice a series of framed images and documents on a shelf. In front of it stands a small table with a journal resting atop.\nWhat do you want to explore?",
        "backTo": "Go up to the Study",
        "option1": "The frames (images and certificates)",
        "option2": "The journal (LinkedIn)"
    },
    "frames": {
        "descriptiveText": "You browse through the frames, discovering maps, portraits, and diplomas.",
        "backTo": "Return to the Hall"
    },
    "study": {
        "descriptiveText": "After climbing the stairs, you push open a door that creaks loudly. Before you unfolds a cluttered room, with books and papers scattered about.\nYour eyes are drawn to a desk with neatly stacked documents. On the oposite wall hangs a board covered in pinned notes.\nWhat do you want to explore next?",
        "backTo": "Go down to the Hall",
        "option1": "The desk (projects)",
        "option2": "The board (CV)"
    },
    "desk": {
        "descriptiveText": "You approach the desk. Several piles of papers rest on its surface. Which one do you want to examine?",
        "backTo": "Return to the Study",
        "projects": [
            {
                "id": 1,
                "title": "Deadpool Hangman",
                "description": "Game where you have to find the word related to Deadpool by leading Dogpool to select the letters",
                "tech": [
                    "HTML",
                    "CSS",
                    "JavaScript"
                ],
                "image": "../assets/aventura.png"
            },
            {
                "id": 2,
                "title": "Travel Journal",
                "description": "Simple application to keep a journal of your travels.",
                "tech": [
                    "React",
                    "Vite",
                    "Mock backend"
                ],
                "image": "../assets/portfolio.png"
            },
            {
                "id": 3,
                "title": "Plantea",
                "description": "Forum to share superb botanical wisdom.",
                "tech": [
                    "React",
                    "Vite",
                    "Node.js",
                    "MongoDB"
                ],
                "image": "../assets/portfolio.png"
            }
        ]
    },
    "pinboard": {
        "descriptiveText": "An old wooden board holds several scrolls pinned with aged bronze tacks. But as you study them closely, you notice they’re all copies of the same arcane message.\nClick here to take one with you.",
        "backTo": "Return to the Study"
    },
    "notFound": {
        "descriptiveText": "You wander down a corridor not marked on any map. The stone beneath your feet groans, and the air grows heavy, as if the castle itself were trying to warn you.\nYou've reached a forgotten place — a page that does not exist… or was sealed away by ancient magic.\nPerhaps it is wise to turn back before it's too late.",
        "backTo": "Return to the beginning"
    }
}